In [2]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [31]:
df = pd.read_csv('DL+cohort+34+(1).csv')

In [32]:
df.columns

Index(['YearsOfExp', 'CompanyName', 'Title', 'Field of Study', 'Major',
       'Gender', 'City', 'State'],
      dtype='object')

In [33]:
df.head(5)

,YearsOfExp,CompanyName,Title,Field of Study,Major,Gender,City,State
0,10+,NaN,NaN,BSc,NaN,NaN,Mumbai,Maharashtra
1,10+,NaN,NaN,B.E,B.E,Female,Bengaluru,Karnataka
2,1,NaN,Analyst,Electronics & Communication Engineering,B.Tech,Male,Mumbai,MAHARASHTRA
3,2,NaN,NaN,B.Tech,B.Tech,Male,Hyderabad,Telangana
4,0,not provided,Project Lead,B.E,B.Tech,Male,Bengaluru,NaN

In [34]:
df.shape

(23, 8)

In [36]:
def convertToInt(s):
    if s=='10+':
        return 10
    else:
        return s

In [37]:
print(convertToInt(4))
print(convertToInt(12))
print(convertToInt('10+'))

4
12
10

In [39]:
df.YearsOfExp = df.YearsOfExp.apply(convertToInt)

In [41]:
df.YearsOfExp

0      10
1      10
2       1
3       2
4       0
5      10
6       2
7      10
8       8
9     7.5
10     10
11    NaN
12    NaN
13      2
14    7.5
15    NaN
16     12
17     10
18      2
19     10
20     10
21    3.5
22    3.5
Name: YearsOfExp, dtype: object

In [45]:
df[['YearsOfExp']].describe()

        YearsOfExp
count           20
unique           8
top             10
freq             8

In [46]:
pd.to_numeric(df.YearsOfExp).mean(skipna=True)

6.55

In [51]:
df[['YearsOfExp']] = df[['YearsOfExp']].fillna(0)

In [52]:
pd.to_numeric(df.YearsOfExp).mean(skipna=False)

5.695652173913044

In [54]:
df.groupby(by='YearsOfExp').count()

            CompanyName  Title  Field of Study  Major  Gender  City  State
YearsOfExp
0                     2      0               3      0       0     3      1
10                    1      1               8      2       2     7      4
0                     1      1               1      1       1     1      0
1                     0      1               1      1       1     1      1
12                    1      0               1      0       0     1      0
2                     1      1               3      3       2     3      2
3.5                   0      0               2      0       0     2      1
7.5                   0      0               2      0       0     2      2
8                     1      1               1      1       1     1      1

In [62]:
df['YearsOfExp'] = pd.to_numeric(df['YearsOfExp'])

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 8 columns):
YearsOfExp        23 non-null float64
CompanyName       7 non-null object
Title             5 non-null object
Field of Study    22 non-null object
Major             8 non-null object
Gender            7 non-null object
City              21 non-null object
State             12 non-null object
dtypes: float64(1), object(7)
memory usage: 1.5+ KB

In [64]:
df['YearsOfExp'] = df['YearsOfExp'].apply(lambda x:10 if x>=10 else x)

In [65]:
df

,YearsOfExp,CompanyName,Title,Field of Study,Major,Gender,City,State
0,10.0,NaN,NaN,BSc,NaN,NaN,Mumbai,Maharashtra
1,10.0,NaN,NaN,B.E,B.E,Female,Bengaluru,Karnataka
2,1.0,NaN,Analyst,Electronics & Communication Engineering,B.Tech,Male,Mumbai,MAHARASHTRA
3,2.0,NaN,NaN,B.Tech,B.Tech,Male,Hyderabad,Telangana
4,0.0,not provided,Project Lead,B.E,B.Tech,Male,Bengaluru,NaN
5,10.0,NaN,NaN,MSc,NaN,NaN,Hyderabad,Maharashtra
6,2.0,NaN,Market Research Analyst,NaN,B.Pharm,Male,NaN,IN
7,10.0,NaN,NaN,B.E,NaN,NaN,Bengaluru,Karnataka
8,8.0,Saurer Textile Solutions,Asst. Manager - Project Planning (Textile Indu...,Textile,B.E,Male,Vadodara,Gujarat
9,7.5,NaN,NaN,MCA,NaN,NaN,SIngapore,Central Singapore Community Development Council
10,10.0,NaN,NaN,Post Graduate Computer Science,NaN,NaN,Bangalore,NaN
11,0.0,Accenture,NaN,"Electronics and telecommunications, BE",NaN,NaN,Bengaluru,NaN
12,0.0,NaN,NaN,Electronics,NaN,NaN,Bengaluru,Karnataka
13,2.0,Smider Electronics,NaN,BE,BE,NaN,Rudrapur,NaN
14,7.5,NaN,NaN,B.E,NaN,NaN,Bengaluru,Karnataka
15,0.0,IPSoft Global Services,NaN,Electrical & Electronics Engg,NaN,NaN,Bengaluru,NaN
16,10.0,BT,NaN,CS,NaN,NaN,Bengaluru,NaN
17,10.0,Reliance Jio,Project Manager,Electrical Engineering,B.Tech,Male,Pune,NaN
18,2.0,NaN,NaN,B.Tech,NaN,NaN,Mumbai,NaN
19,10.0,NaN,NaN,B.E,NaN,NaN,NaN,NaN
20,10.0,NaN,NaN,B.E,NaN,NaN,Bengaluru,NaN
21,3.5,NaN,NaN,B.Tech,NaN,NaN,Hyderabad,Telangana
22,3.5,NaN,NaN,B.Tech,NaN,NaN,Bengaluru,NaN

In [67]:
df['YearsOfExp'].describe()

count    23.000000
mean      5.608696
std       4.234481
min       0.000000
25%       2.000000
50%       7.500000
75%      10.000000
max      10.000000
Name: YearsOfExp, dtype: float64

In [69]:
df.groupby(by='YearsOfExp').

            CompanyName  Title  Field of Study  Major  Gender  City  State
YearsOfExp
0.0                   3      1               4      1       1     4      1
1.0                   0      1               1      1       1     1      1
2.0                   1      1               3      3       2     3      2
3.5                   0      0               2      0       0     2      1
7.5                   0      0               2      0       0     2      2
8.0                   1      1               1      1       1     1      1
10.0                  2      1               9      2       2     8      4

In [70]:
df.YearsOfExp.sum()

129.0

In [73]:
a = pd.value_counts(df.YearsOfExp)

In [74]:
print(a, type(a))

10.0    9
0.0     4
2.0     4
3.5     2
7.5     2
8.0     1
1.0     1
Name: YearsOfExp, dtype: int64 <class 'pandas.core.series.Series'>

In [75]:
a.describe()

count    7.000000
mean     3.285714
std      2.811541
min      1.000000
25%      1.500000
50%      2.000000
75%      4.000000
max      9.000000
Name: YearsOfExp, dtype: float64

In [76]:
a.sum()

23

In [77]:
9/23

0.391304347826087

In [78]:
9/19

0.47368421052631576

In [88]:
df.pivot_table( values=df, columns=['YearsOfExp'], aggfunc=sum)

YearsOfExp,0.0,1.0,3.5,7.5,8.0,10.0
City,BengaluruBengaluruBengaluruBengaluru,Mumbai,HyderabadBengaluru,SIngaporeBengaluru,Vadodara,NaN
CompanyName,NaN,0,0,0,Saurer Textile Solutions,NaN
Field of Study,"B.EElectronics and telecommunications, BEElect...",Electronics & Communication Engineering,B.TechB.Tech,MCAB.E,Textile,BScB.EMScB.EPost Graduate Computer ScienceCSEl...
Gender,NaN,Male,0,0,Male,NaN
Major,NaN,B.Tech,0,0,B.E,NaN
State,NaN,MAHARASHTRA,NaN,Central Singapore Community Development Counci...,Gujarat,NaN
Title,NaN,Analyst,0,0,Asst. Manager - Project Planning (Textile Indu...,NaN

In [89]:
df.columns

Index(['YearsOfExp', 'CompanyName', 'Title', 'Field of Study', 'Major',
       'Gender', 'City', 'State'],
      dtype='object')

In [90]:
df.groupby('Gender').count()

        YearsOfExp  CompanyName  Title  Field of Study  Major  City  State
Gender
Female           1            0      0               1      1     1      1
Male             6            3      5               5      6     5      4

In [92]:
df.pivot_table(values=df, index=['Gender'], aggfunc='mean')

        YearsOfExp
Gender
Female   10.000000
Male      3.833333

In [97]:
df.Gender.value_counts(normalize=True)

Male      0.857143
Female    0.142857
Name: Gender, dtype: float64

In [98]:
df.YearsOfExp.value_counts(normalize=True)

10.0    0.391304
0.0     0.173913
2.0     0.173913
3.5     0.086957
7.5     0.086957
8.0     0.043478
1.0     0.043478
Name: YearsOfExp, dtype: float64

In [100]:
df.City.value_counts

<bound method IndexOpsMixin.value_counts of 0        Mumbai
1     Bengaluru
2        Mumbai
3     Hyderabad
4     Bengaluru
5     Hyderabad
6           NaN
7     Bengaluru
8      Vadodara
9     SIngapore
10    Bangalore
11    Bengaluru
12    Bengaluru
13     Rudrapur
14    Bengaluru
15    Bengaluru
16    Bengaluru
17         Pune
18       Mumbai
19          NaN
20    Bengaluru
21    Hyderabad
22    Bengaluru
Name: City, dtype: object>